<a href="https://colab.research.google.com/github/Louismada29/Practice_Advanced_DataFrame/blob/main/Advanced_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

# Merging DataFrame

In [2]:
kiri = pd.DataFrame({
    'Id':[1,2,3],
    'Nama':['Budi','Joko','Maya'],
    'Alamat':['Jakarta','Surabaya','Medan']
})
kanan = pd.DataFrame({
    'Id':[1,2,3],
    'Nama':['Jane','Mike','Dave'],
    'Alamat':['Semarang','Yogya','Solo']
})
print(kiri)
print(kanan)

   Id  Nama    Alamat
0   1  Budi   Jakarta
1   2  Joko  Surabaya
2   3  Maya     Medan
   Id  Nama    Alamat
0   1  Jane  Semarang
1   2  Mike     Yogya
2   3  Dave      Solo

In [3]:
gabung = pd.merge(kiri,kanan, on='Id') # default = inner join
gabung

   Id Nama_x  Alamat_x Nama_y  Alamat_y
0   1   Budi   Jakarta   Jane  Semarang
1   2   Joko  Surabaya   Mike     Yogya
2   3   Maya     Medan   Dave      Solo

In [11]:
karyawan = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat':['Jakarta','Surabaya','Medan'],
    'Id Pekerjaan':[1,7,2]
})
pekerjaan = pd.DataFrame({
    'Id Pekerjaan':[2,1,4,3],
    'Nama':['Programmer','Data Engineer','Manager', 'Web Developer'],
    'Gaji':[5000,4000,3000,6000]
})
print(karyawan)
print(pekerjaan)

   Nama    Alamat  Id Pekerjaan
0  Budi   Jakarta             1
1  Joko  Surabaya             7
2  Maya     Medan             2
   Id Pekerjaan           Nama  Gaji
0             2     Programmer  5000
1             1  Data Engineer  4000
2             4        Manager  3000
3             3  Web Developer  6000

In [15]:
gabung_pekerjaan = pd.merge(karyawan,pekerjaan, on= 'Id Pekerjaan',how = 'left',sort= True,suffixes=('_Pegawai','_Pekerjaan'))
gabung_pekerjaan

  Nama_Pegawai    Alamat  Id Pekerjaan Nama_Pekerjaan    Gaji
0         Budi   Jakarta             1  Data Engineer  4000.0
1         Maya     Medan             2     Programmer  5000.0
2         Joko  Surabaya             7            NaN     NaN

# Joining DataFrame

In [16]:
karyawan = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat':['Jakarta','Surabaya','Medan'],
    'Id Pekerjaan':[1,7,2]
})
pekerjaan = pd.DataFrame({
    'Id Pekerjaan':[2,1,4,3],
    'Nama':['Programmer','Data Engineer','Manager', 'Web Developer'],
    'Gaji':[5000,4000,3000,6000]
})
print(karyawan)
print(pekerjaan)

   Nama    Alamat  Id Pekerjaan
0  Budi   Jakarta             1
1  Joko  Surabaya             7
2  Maya     Medan             2
   Id Pekerjaan           Nama  Gaji
0             2     Programmer  5000
1             1  Data Engineer  4000
2             4        Manager  3000
3             3  Web Developer  6000

In [21]:
gabung_join = karyawan.join(pekerjaan,on= 'Id Pekerjaan', how='inner',lsuffix='_pegawai',rsuffix='_pekerjaan' )
gabung_join

   Id Pekerjaan Nama_pegawai  ... Nama_pekerjaan  Gaji
0             1         Budi  ...  Data Engineer  4000
2             2         Maya  ...        Manager  3000

[2 rows x 7 columns]

# Concatenate DataFrame

In [27]:
left = pd.DataFrame({
    'Nama':['Budi','Joko','Maya'],
    'Alamat':['Jakarta','Surabaya','Medan']
})
right = pd.DataFrame({
    'Nama':['Jane','Mike','Dave'],
    'Alamat':['Semarang','Yogya','Solo']
})
gabung_concat = pd.concat([left, right],axis = 0, ignore_index=True)
gabung_concat

   Nama    Alamat
0  Budi   Jakarta
1  Joko  Surabaya
2  Maya     Medan
3  Jane  Semarang
4  Mike     Yogya
5  Dave      Solo

In [24]:
gabung_concat = pd.concat([left, right],axis = 1)
gabung_concat

   Nama    Alamat  Nama    Alamat
0  Budi   Jakarta  Jane  Semarang
1  Joko  Surabaya  Mike     Yogya
2  Maya     Medan  Dave      Solo

In [31]:
left = pd.DataFrame({
    'Nama':['Budi','Joko','Maya'],
    'Alamat':['Jakarta','Surabaya','Medan']
})
right = pd.DataFrame({
    'Nama':['Jane','Mike','Dave'],
    'Gaji':[5000,4000,3000]
})
gabung_concat2 = pd.concat([left, right],axis = 0, ignore_index=True, join='outer')
gabung_concat2

   Nama    Alamat    Gaji
0  Budi   Jakarta     NaN
1  Joko  Surabaya     NaN
2  Maya     Medan     NaN
3  Jane       NaN  5000.0
4  Mike       NaN  4000.0
5  Dave       NaN  3000.0

In [33]:
gabung_concat2 = pd.concat([left, right],axis = 1, ignore_index=True, join='outer')
gabung_concat2

      0         1     2     3
0  Budi   Jakarta  Jane  5000
1  Joko  Surabaya  Mike  4000
2  Maya     Medan  Dave  3000

In [34]:
left = pd.DataFrame({
    'Nama':['Budi','Joko','Maya'],
    'Alamat':['Jakarta','Surabaya','Medan']
})
right = pd.DataFrame({
    'Id Pekerjaan':[2,1,4,3],
    'Nama':['Programmer','Data Engineer','Manager', 'Web Developer'],
    'Gaji':[5000,4000,3000,6000]
})
gabung_concat3 = pd.concat([left, right],axis = 1, join='outer')
gabung_concat3

   Nama    Alamat  Id Pekerjaan           Nama  Gaji
0  Budi   Jakarta             2     Programmer  5000
1  Joko  Surabaya             1  Data Engineer  4000
2  Maya     Medan             4        Manager  3000
3   NaN       NaN             3  Web Developer  6000

# Append DataFrame

In [43]:
left = pd.DataFrame({
    'Nama':['Budi','Joko','Maya'],
    'Alamat':['Jakarta','Surabaya','Medan']
})
right = pd.DataFrame({
    'Nama':['Jane','Mike','Dave'],
    'Alamat':['Semarang','Yogya','Solo']
})
gabung_append= left.append(right, ignore_index=True)
gabung_append

   Nama    Alamat
0  Budi   Jakarta
1  Joko  Surabaya
2  Maya     Medan
3  Jane  Semarang
4  Mike     Yogya
5  Dave      Solo

# Indexing in DataFrame

## Reset Index

In [46]:
left = pd.DataFrame({
    'Nama':['Budi','Joko','Maya'],
    'Alamat':['Jakarta','Surabaya','Medan']
})
right = pd.DataFrame({
    'Nama':['Jane','Mike','Dave'],
    'Alamat':['Semarang','Yogya','Solo']
})
gabung_append2= left.append(right)
gabung_append2

   Nama    Alamat
0  Budi   Jakarta
1  Joko  Surabaya
2  Maya     Medan
0  Jane  Semarang
1  Mike     Yogya
2  Dave      Solo

In [47]:
new = gabung_append2.reset_index(drop= True)
new

   Nama    Alamat
0  Budi   Jakarta
1  Joko  Surabaya
2  Maya     Medan
3  Jane  Semarang
4  Mike     Yogya
5  Dave      Solo

## Set Index

In [58]:
#set_index
left = pd.DataFrame({
    'ID':['001','002','003'],
    'Nama':['Budi','Joko','Maya'],
    'Alamat':['Jakarta','Surabaya','Medan']
})
print(left)

    ID  Nama    Alamat
0  001  Budi   Jakarta
1  002  Joko  Surabaya
2  003  Maya     Medan

In [59]:
left.set_index('ID',inplace=True)
left

     Nama    Alamat
ID
001  Budi   Jakarta
002  Joko  Surabaya
003  Maya     Medan

In [63]:
left.loc['003']

Nama       Maya
Alamat    Medan
Name: 003, dtype: object

# Pivoting Table

In [65]:
employee = pd.DataFrame({
    'Emp Id':['001','002','003','004','005','006'],
    'Nama':['Budi','Joko','Maya','Andi','Dewi','Dian'],
    'Gender':['Pria','Pria','Perempuan','Pria','Perempuan','Perempuan'],
    'Pekerjaan':['Programmer','Data Engineer','Programmer','Manager','Manager','Manager'],
    'Gaji':[5000,4000,5000,6000,8000,6000]
})
employee

  Emp Id  Nama     Gender      Pekerjaan  Gaji
0    001  Budi       Pria     Programmer  5000
1    002  Joko       Pria  Data Engineer  4000
2    003  Maya  Perempuan     Programmer  5000
3    004  Andi       Pria        Manager  6000
4    005  Dewi  Perempuan        Manager  8000
5    006  Dian  Perempuan        Manager  6000

In [74]:
pivot_table = pd.pivot_table(employee, columns=['Gender','Pekerjaan'], aggfunc={'Gaji':'mean','Pekerjaan':'count'})
pivot_table

Gender    Perempuan                     Pria
Pekerjaan   Manager Programmer Data Engineer Manager Programmer
Gaji           7000       5000          4000    6000       5000
Pekerjaan         2          1             1       1          1

## Melting Table

In [79]:
mahasiswa = pd.DataFrame({
    'Mhs Id':['001','002','003'],
    'Nama':['Budi','Joko','Maya'],
    'Bhs Inggris':[100,90,98],
    'Matematika':[90,87,72],
    'Ekonomi':[90,80,78]
})
mahasiswa

  Mhs Id  Nama  Bhs Inggris  Matematika  Ekonomi
0    001  Budi          100          90       90
1    002  Joko           90          87       80
2    003  Maya           98          72       78

In [80]:
melt_table= pd.melt(mahasiswa,id_vars=['Mhs Id','Nama'], value_vars=['Bhs Inggris','Matematika','Ekonomi'])
melt_table

  Mhs Id  Nama     variable  value
0    001  Budi  Bhs Inggris    100
1    002  Joko  Bhs Inggris     90
2    003  Maya  Bhs Inggris     98
3    001  Budi   Matematika     90
4    002  Joko   Matematika     87
5    003  Maya   Matematika     72
6    001  Budi      Ekonomi     90
7    002  Joko      Ekonomi     80
8    003  Maya      Ekonomi     78

# Lambda Functions

In [75]:
x = lambda a,b : a*b
print(x(5,6))

30

In [76]:
y = lambda a: a+10
print(y(5))

15

In [77]:
status = lambda umur: 'remaja' if umur >10 and umur <20 else 'bukan remaja'
print(status(16))

remaja

In [91]:
# apply
student = pd.DataFrame({
    'Mhs Id':['001','002','003'],
    'Nama':['Budi','Joko','Maya'],
    'Matematika':[100,80,67],
})
student

  Mhs Id  Nama  Matematika
0    001  Budi         100
1    002  Joko          80
2    003  Maya          67

In [92]:
student['Grade'] = student['Matematika'].apply(lambda nilai:
                                                 'A' if nilai >=90 else('B' if nilai >=70 and nilai<90 else 'C'))
student

  Mhs Id  Nama  Matematika Grade
0    001  Budi         100     A
1    002  Joko          80     B
2    003  Maya          67     C